Revit 2024 API
NamingUtils.IsValidName Method
 Identifies if the input string is valid for use as an object name in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool IsValidName(
	string string
)
Visual Basic
Public Shared Function IsValidName ( _
	string As String _
) As Boolean
Visual C++
public:
static bool IsValidName(
	String^ string
)
Parameters
string
Type: System.String
 The name to validate.
Return Value
 True if the name is valid for use as a name in Revit, false if it contains prohibited characters and is invalid.
Remarks
 This routine checks only for prohibited characters in the string. When setting the name for an object there are other specific considerations which are checked (for example, the same name cannot be used twice for different elements of the same type). This routine does not check those conditions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
NamingUtils Class
Autodesk.Revit.DB Namespace